app/Models/Model_user.php

    public function all_data()
    {
        return $this->db->table('tbl_user')
        ->join('tbl_dep', 'tbl_dep.id_dep = tbl_user.id_dep', 'left')
        //->orderBy('id_user','DESC')
        ->orderBy('level')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_user`.`id_dep`
ORDER BY `level`