app/Models/Model_kategori.php

    public function all_data()
    {
        return $this->db->table('tbl_kategori')
        ->orderBy('nama_kategori')
---
SELECT *
FROM `tbl_kategori`
ORDER BY `nama_kategori`