app/Models/Model_dep.php

    public function all_data()
    {
        return $this->db->table('tbl_dep')
        ->orderBy('nama_dep')
---
SELECT *
FROM `tbl_dep`
ORDER BY `nama_dep`