app/Models/Model_user.php

    public function all_data()
    {
        return $this->db->table('tbl_user')
        ->join('tbl_dep', 'tbl_dep.id_dep = tbl_user.id_dep', 'left')
        //->orderBy('id_user','DESC')
        ->orderBy('nama_user')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_user`.`id_dep`
ORDER BY `nama_user`

    public function detail_data($id_user)
    {
        return $this->db->table('tbl_user')
        ->join('tbl_dep', 'tbl_dep.id_dep = tbl_user.id_dep', 'left')
        ->where('id_user',$id_user)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_user`.`id_dep`
WHERE `id_user` = '5'

    public function edit($data)
    {
        $this->db->table('tbl_user')->where('id_user',$data['id_user'])->update($data);
---
UPDATE `tbl_user` SET `id_user` = '3', `nama_user` = 'Admin', `password` = 'naila123', `level` = '2', `id_dep` = '6'
WHERE `id_user` = '3'

    public function delete_data($data)
    {
        $this->db->table('tbl_user')->where('id_user',$data['id_user'])->delete($data);
---
DELETE FROM `tbl_user`
WHERE `id_user` = '7'
AND `id_user` = '7'