app/Models/Model_arsip.php

SELECT *
FROM `tbl_arsip`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_arsip`.`id_dep`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_arsip`.`id_user`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
ORDER BY `id_arsip` DESC
---
    public function all_data()
    {
        return $this->db->table('tbl_arsip')
        ->join('tbl_dep', 'tbl_dep.id_dep = tbl_arsip.id_dep', 'left')
        ->join('tbl_user', 'tbl_user.id_user = tbl_arsip.id_user', 'left')
        ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori', 'left')
        ->orderBy('id_arsip','DESC')
        ->get()
        ->getResultArray();